Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/svd/PIC32CK2051SG00100.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SQI</name>
         <version>040444b0</version>
         <description>Polaris Serial Quad Interface SIB</description>
         <groupName>SQI</groupName>
         <prependToName>SQI_</prependToName>
         <baseAddress>0x0FFFF000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x16C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SQI</name>
            <value>146</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWRSTSelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>No reset in progress</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Reseting the registers and EIP</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RUNSTDBYSelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Module is disabled in Standby Sleep mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Module continues to run in Standby Sleep mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQI</name>
                     <description>SQI Interrupt Enable Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SQISelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Interrupt Enabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Interrupt Disabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQI</name>
                     <description>SQI Interrupt Enable Set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SQISelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Interrupt disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Interrupt enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Status and Clear Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQI</name>
                     <description>Read value reflects the state of the interrupt flag. Do not use the interrupt flag and associated mask registers if the EIP already provides similar controls for its interrupts. This feature is design for interrupts created in the SIB or EIP which do not have mask or flag bits. Write to 1 to clear the flag.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Syncbusy Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Synchronization Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWRSTSelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>SWRST synchronization is not busy</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>SWRST synchronization is busy</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>XCON1</name>
               <description>SPI XIP Control1 register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x202C0C00</resetValue>
               <fields>
                  <field>
                     <name>TYPECMD</name>
                     <description>SPI TYPE Command  - Single lane mode, - Dual lane mode, - Quad lane mode, - Reserved for Future use, Based on this field, the boot controller will send the command in 1/2/4 lane.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TYPEADDR</name>
                     <description>SPI TYPE Address 00 - Single lane mode ,01 - Dual lane mode ,10 - Quad lane mode ,11 - Reserved for Future use  Based on this field, the boot controller will send  the Address in 1/2/4 lane.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TYPEMODE</name>
                     <description>SPI TYPE Mode: 00 - Single lane mode, 01 - Dual lane mode, 10 - Quad lane mode, 11 - Reserved for Future use. Based on this field, the boot controller will send the Mode in 1/2/4 lane.</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TYPEDUMMY</name>
                     <description>SPI TYPE DUMMY: 00 - Single lane mode ,01 - Dual lane mode,10 - Quad lane mode ,11 - Reserved for Future use. Based on this field, the boot controller will send the Dummy in 1/2/4 lane.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TYPEDATA</name>
                     <description>SPI TYPE DATA: 00 - Single lane mode  ,01 - Dual lane mode  ,10 - Quad lane mode  ,11 - Reserved for Future use  Based on this field, the boot controller will receive the data in 1/2/4 lane.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>READOPCODE</name>
                     <description>8bit opcode value for Read operation</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDRBYTES</name>
                     <description>000  - Zero Address Bytes ,001  - 1 Address Byte ,010  - 2 Address Bytes ,011  - 3 Address Bytes ,100  - 4 Address Bytes ,101  - 111- Reserved for Future Use</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DUMMYBYTES</name>
                     <description>000  - Zero Dummy bytes ,001  - Transmit one dummy byte (8?h ff) ,010  - Transmit two dummy bytes (16?h ffff) ,011  - Transmit three dummy bytes (24?h ffffff) ,111  - Transmit Seven dummy bytes</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DDRCMD</name>
                     <description>XIP SPI TYPE CMD DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the command in SDR/DDR mode.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDRADDR</name>
                     <description>XIP SPI TYPE ADDR DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the address bytes in SDR/DDR mode.</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDRMODE</name>
                     <description>XIP SPI TYPE MODE DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send the mode bytes in SDR/DDR mode.</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDRDUMMY</name>
                     <description>XIP SPI TYPE DUMMY DDR. 0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send the dummy bytes in SDR/DDR mode.</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDRDATA</name>
                     <description>XIP SPI TYPE DATA DDR  0 - SDR mode, 1 - DDR mode. Based on this field, the boot controller will send  the data in SDR/DDR mode.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SDRCMD</name>
                     <description>SPI TYPE CMD SDR2DDR: This bit is used by the controller only when  XIP_SPI_TYPE_CMD_DDR is 1?b1 i.e., when command sent in DDR mode. 0 - The command (XIP_SPI_READ_OPCODE) will take 4 clock cycles. Data will go in both the edges. Used when Flash expecting the cmd in ddr mode. Here the command will go as 1byte only. 1- The command (XIP_SPI_READ_OPCODE) will take 8 clock cycles. Data will go in both the edges. Used when Flash expecting the cmd in sdr mode, but user wants to send in ddr mode. Here the command will go as 2bytes. The value (single byte) programmed in XIP_SPI_READ_OPCODE is replicated into 2bytes by the controller and sent on spi bus. Example for CMD SDR2DDR bit 1: Say opcode = 'h ac (1010 1100) Replicated pattern 11 00 11 00 11 11 00 00 ('h ccf0). So 1st 4 clock cycles hcc; next 4 clock cycles hf0 goes on spi bus.</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>XCON2</name>
               <description>SPI XIP Control2 register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <resetValue>0x000000A0</resetValue>
               <fields>
                  <field>
                     <name>MODECODE</name>
                     <description>8bit value for Mode byte</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MODEBYTES</name>
                     <description>Mode Bytes 00 - 0 Mode Bytes , 01 - 1 Mode Byte , 10 - 2 Mode Bytes , 11 - 3 Mode Bytes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DEVSEL</name>
                     <description>XIP SPI Device Select: This field is used to select a particular SPI device 000 - Select Device0 , 001 - Select Device1 , 010 - Select Device2 , 011 - Select Device3 , 100 - Select Device4 , 101 - Select Device5 , 110 - Select Device6 , 111 - Select Device7</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG</name>
               <description>SPI Configuration Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <resetValue>0x01007E01</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Mode Select The default value of this field is 0. After power on reset, the controller enters boot mode. 000 - Boot mode. The CSR registers are loaded with boot strap values. 001 - PIO mode. The controller is controlled by the CPU in PIO mode. 010 - DMA mode.  011 - XIP mode. When this mode is entered the controller behaves as if executing in Place (XIP) but uses the register data to control timing. 100 - 111 - Reserved</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CPHA</name>
                     <description>Clock phase (selects the transfer format) 0 = SPICLK starts toggling at the middle of 1st data bit. 1 = SPICLK starts toggling at the start of 1st data bit.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOL</name>
                     <description>Clock polarity 0 = active-high SPICLK (SPICLK low is the idle state) 1 = active-low SPICLK (SPICLK high is the idle state)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSBF</name>
                     <description>Data format on SPI interface  0 = MSBit sent/received first. 1 = LSBit sent/received first.  This setting is supeceded by LSBF control bit in Buffer Descriptor during DMA operations.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WP</name>
                     <description>Write Protect: In single or Dual lane mode, this bit is used to drive the spiout2 signal. Whenever this bit is high, the controller drives 0 on spiout2 line and sets spimoe2 high (active only during transfer).</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HOLD</name>
                     <description>Hold: In Single or Dual lane mode, this bit is used to drive the spiout3 signal. Whenever this bit is high, the controller drives 0 on spiout3 line and sets spimoe3 high (active only during transfer).</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BURSTEN</name>
                     <description>This field is used to configure the AHB Master Burst capability. 1 - AHB INCR is enabled 0 - AHB INCR is disabled</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB_BURST_INCR4_EN</name>
                     <description>This field is used to configure the AHB Master Burst capability. 1 - AHB INCR4 is enabled. 0 - AHB INCR4 is disabled</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB_BURST_INCR8_EN</name>
                     <description>This field is used to configure the AHB Master Burst capability. 1 - AHB INCR8 is enabled. 0 - AHB INCR8 is disabled</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHB_BURST_INCR16_EN</name>
                     <description>This field is used to configure the AHB Master Burst capability.  1 - AHB INCR16 is enabled.  0 - AHB INCR16 is disabled</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXBUFRST</name>
                     <description>Transmit FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Transmit FIFO pointers will get reset by this reset pulse. Note: Transmit FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during  transaction, we need to go for soft reset only.Note: For Michigan Ax versions, treat as Reserved, keep 0.</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBUFRST</name>
                     <description>Receive FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Receive fifo pointers will get reset by this reset pulse. Note: Receive FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during transaction, we need to go for soft reset only. Note: For Michigan Ax versions, treat as Reserved, keep 0.</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONBUFRST</name>
                     <description>Control FIFO Reset A reset pulse is generated when writing 1 to this bit. This bit is Auto clear and SPI Controller will clear this bit. Control fifo pointers will get reset by this reset pulse. Note: Control FIFO reset can be done only after a transaction is complete on spi bus; however if we want to reset FIFO during transaction, we need to go for soft reset only. Note: For Michigan Ax versions, treat as Reserved, keep 0.</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAEN</name>
                     <description>Max Data Lanes 11 - Reserved, 10 - 4, 01 - 2, 00 - 1 SPI_OUT_PIN_EN[3:0] output pins are controlled by writing to these bits.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SQIEN</name>
                     <description>1 - Enabled, 0 - Disabled SPI_ON output pin is controlled by writing to  this bit.</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEN</name>
                     <description>1 - Chip Select is used 0 - Chip Select is not used SPI_CS[7] for  CS7, SPI_CS[6] for  CS6, SPI_CS[5] for  CS5, SPI_CS[4] for  CS4, SPI_CS[3] for  CS3, SPI_CS[2] for  CS2, SPI_CS[1] for  CS1, SPI_CS[0] for  CS0. SPI_CS_PIN_EN[7:0/3:0] output pins are  controlled by writing to these bits.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
